use StudentDB
Go

if OBJECT_ID('dbo.Tabl_uch1', 'U') is null
create table Tabl_uch1
(
	id int primary key identity,
	fio varchar(50),
	predmet varchar(50),
	ush varchar(50),
	ball float
);
Go

insert Tabl_uch1 values
('Иванова','математика','лицей',98.5),
('Петров','физика','лицей',99),
('Сидоров','математика','лицей',88),
('Полухина','физика','гимназия',78),
('Матвеева','химия','лицей',92),
('Касимов','химия','гимназия',68),
('Нестеров','математика','гимназия',81),
('Авдеев','физика','лицей',87),
('Никитина','химия','лицей',94),
('Барышев','химия','лицей',88)
Go