use groupBD

if OBJECT_ID('dbo.School', 'U') is null
create table School
(
	id int primary key identity,
	fio varchar(50),
	predmet varchar(50),
	ush varchar(50),
	ball float
)
Go

insert School  values
('Иванова', 'математика', 'лицей', 98.5),
('Петров', 'физика', 'лицей', 99),
('Сидоров', 'математика', 'лицей', 88),
('Полухина', 'физика', 'гимназия', 78),
('Матвеева', 'химия', 'лицей', 92),
('Касимова', 'химия', 'гимназия', 68),
('Нестеров', 'математика', 'гимназия', 81),
('Авдеев', 'физика', 'лицей', 87),
('Никитина', 'химия', 'лицей', 94),
('Барышева', 'химия', 'лицей', 88)
Go

--7.1
if OBJECT_ID('db0.test_table_pivot', 'U') is null
CREATE TABLE test_table_pivot(
 fio varchar(50) NULL,
 god int NULL,
 summa float NULL
 )
 Go

 --7.2
 insert test_table_pivot values
 ('Иванов И.И.', 2011, 200),
 ('Иванов И.И.', 2011, 500),
 ('Иванов И.И.', 2012, 300),
 ('Иванов И.И.', 2012, 600),
 ('Иванов И.И.', 2013, 900),
 ('Иванов И.И.', 2014, 500),
 ('Иванов И.И.', 2014, 300),
 ('Иванов И.И.', 2015, 100),
 ('Петров П.П.', 2011, 100),
 ('Петров П.П.', 2012, 200),
 ('Петров П.П.', 2012, 300),
 ('Петров П.П.', 2013, 100),
 ('Петров П.П.', 2014, 300),
 ('Петров П.П.', 2014, 100),
 ('Сидоров С.С', 2012, 100),
 ('Сидоров С.С', 2013, 1000),
 ('Сидоров С.С', 2014, 500),
 ('Сидоров С.С', 2014, 300),
 ('Сидоров С.С', 2015, 300)
 Go

 --1
 if OBJECT_ID('dbo.Employee', 'U') is null
 create table Employee
 (
	id int primary key identity,
	manager varchar(50),
	otdel varchar(50),
	god int,
	summa float
 );
 Go

 --2
 insert Employee values
 ('Сотрудник_1', 'Бухгалтерия', 2014, 200.00),
 ('Сотрудник_2', 'Бухгалтерия', 2014, 300.00),
 ('Сотрудник_3', 'Отдел покупок', 2014, 150.00),
 ('Сотрудник_4', 'Отдел покупок', 2014, 200.00),
 ('Сотрудник_5', 'Отдел реализации', 2014, 250.00),
 ('Сотрудник_6', 'Отдел реализации', 2014, 300.00),
 ('Сотрудник_7', 'Отдел реализации', 2014, 300.00),
 ('Сотрудник_1', 'Бухгалтерия', 2015, 230.00),
 ('Сотрудник_2', 'Бухгалтерия', 2015, 200.00),
 ('Сотрудник_3', 'Отдел покупок', 2015, 200.00),
 ('Сотрудник_4', 'Отдел покупок', 2015, 300.00),
 ('Сотрудник_5', 'Отдел реализации', 2015, 200.00),
 ('Сотрудник_6', 'Отдел реализации', 2015, 250.00),
 ('Сотрудник_7', 'Отдел реализации', 2015, 350.00)